{
  "magic": "E!vIA5L86J2I",
  "timestamp": "2025-02-06T01:27:10.688286+00:00",
  "repo": "ietf-rats-wg/draft-smith-rats-evidence-trans",
  "labels": [
    {
      "name": "bug",
      "description": "Something isn't working",
      "color": "d73a4a"
    },
    {
      "name": "documentation",
      "description": "Improvements or additions to documentation",
      "color": "0075ca"
    },
    {
      "name": "duplicate",
      "description": "This issue or pull request already exists",
      "color": "cfd3d7"
    },
    {
      "name": "enhancement",
      "description": "New feature or request",
      "color": "a2eeef"
    },
    {
      "name": "good first issue",
      "description": "Good for newcomers",
      "color": "7057ff"
    },
    {
      "name": "help wanted",
      "description": "Extra attention is needed",
      "color": "008672"
    },
    {
      "name": "invalid",
      "description": "This doesn't seem right",
      "color": "e4e669"
    },
    {
      "name": "question",
      "description": "Further information is requested",
      "color": "d876e3"
    },
    {
      "name": "wontfix",
      "description": "This will not be worked on",
      "color": "ffffff"
    }
  ],
  "issues": [
    {
      "number": 1,
      "id": "I_kwDOMOnZXM6XWALy",
      "title": "Truth tables should not use abbreviations",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/issues/1",
      "state": "CLOSED",
      "author": "nedmsmith",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [],
      "labels": [],
      "body": "The truth tables in section 8.2.1 Internal Representation of Conceptual Messages uses abbreviations for the various attributes of the ECT structure. These should be replaced with more readable values used in the ECT CDDL.",
      "createdAt": "2024-09-20T15:43:40Z",
      "updatedAt": "2024-09-20T15:49:42Z",
      "closedAt": "2024-09-20T15:49:42Z",
      "comments": []
    },
    {
      "number": 2,
      "id": "I_kwDOMOnZXM6XWB2O",
      "title": "Use of parens surrounding cross-references",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/issues/2",
      "state": "OPEN",
      "author": "nedmsmith",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [],
      "labels": [],
      "body": "I believe it is a document convention to surround cross-references with parens: e.g.: \r\n```\r\n({{my-cross-reference}})\r\n```\r\n\r\nA cleanup task is needed that fixes all the instances that don't conform to the convention.",
      "createdAt": "2024-09-20T15:46:54Z",
      "updatedAt": "2024-09-20T15:46:54Z",
      "closedAt": null,
      "comments": []
    },
    {
      "number": 5,
      "id": "I_kwDOMOnZXM6ofhQD",
      "title": "Which key should be the authority for evidence from DICE/SPDM",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/issues/5",
      "state": "OPEN",
      "author": "andrew-draper",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "Which key should be put into the authority entry of DICE/SPDM generated evidence?\n\nIt needs to be something which the verifier can match against, so it must be a global key rather than a device specific key.\n\nI suggest that the certificate chain root key authorising the DICE/SPDM evidence is used for this. If there are multiple certificate chains available then all root keys \n\nIt might be worth adding a section describing this.",
      "createdAt": "2025-02-03T08:59:07Z",
      "updatedAt": "2025-02-03T16:40:21Z",
      "closedAt": null,
      "comments": [
        {
          "author": "nedmsmith",
          "authorAssociation": "CONTRIBUTOR",
          "body": "The verifier matching rule is based on authorized-by condition. It can be any key. \nThe key that generated the signature over the digest of the claims should be the key that is in the authority field in the ECT. Note that in the SPDM case, the slot contains the full cert chain. The $crypto-key-type-choice varients that support the full chain might be advised? The authorized-by matching should follow the same convention. \n\nNote that the cert chain will include the device ID cert which is the global identity hence the cert chain is globally unique. ",
          "createdAt": "2025-02-03T16:40:20Z",
          "updatedAt": "2025-02-03T16:40:20Z"
        }
      ]
    },
    {
      "number": 6,
      "id": "I_kwDOMOnZXM6oflKd",
      "title": "Need text describing how instance field is used to separate evidence from multiple attesters",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/issues/6",
      "state": "OPEN",
      "author": "andrew-draper",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "If there are multiple attesters then the Verifier needs a way to separate evidence from them.\n\nThe instance field should be filled in with a value derived from the deviceid key to ensure that evidence from each verifier is kept separate.",
      "createdAt": "2025-02-03T09:04:10Z",
      "updatedAt": "2025-02-04T21:35:13Z",
      "closedAt": null,
      "comments": [
        {
          "author": "nedmsmith",
          "authorAssociation": "CONTRIBUTOR",
          "body": "If the evidence authority uses a $crypto-key-type-choice that is a cert chain, then the chain will contain the deviceID cert making the authority globally unique. \n\nHowever, there is a different issue you're describing (I think) which is how does the Attester uniquely identify itself to the Verifier. There are two parts to the attester-verifier session. Authentication (which should use the deviceID key) and evidence collection which should use whatever attestation keys are most appropriate for the evidence that is reported. It's best to think of these as different keys. \n\nNote there is a thread on RATS which is arguing for these keys being mandatorily separate as one of the researchers has identified this as a potential security flaw.\n\nThe way corim can express the identity of the attester is using instance-id in environment-map where the ID value references the deviceID key. This could be done using the DeviceID directly, or some variant of the $crypto-key-type-choice that includes the DeviceID key. The identity of the device could be one of the claims asserted as part of connection establishment (maybe the DeviceID cert should have a bit of evidence that makes this claim)? Remember when we discussed whether to use some of the cert fields as evidence but decided not to? The consequence of that decision is the identity of device needs to be repeated in the DiceTcbInfo fields for the instance-id claim to be tied to the deviceID. \n\nThe DiceTcbInfo.type field is an OCTET STRING: \"type – a machine readable description of the measurement.\" \n\nFor this to match a reference value environment-map.instance-id.$crypto-key-type-choice. It (OCTET STRING) needs to start with a CBOR tag. (Actually all measurement-map values start with a CBOR tag). But using $crypto-key-type-choice allows the devid cert to be used as a way to link the deviceID cert to the device and for any attestation key in the same device to be linked to the deviceID. \n\nNote: If the deviceID cert contains only the DiceTcbInfo.`type` value. The reference value needs to be able to match this evidence. Since the external representation of Ref-Val triple makes measurement-map mandatory, there needs to be a measurement also. In this particular case, it makes sense to repeat the DeviceID key in the measurement-values-map.$crypto-key-type-choice. We can document it this way this convention to avoid having to make a pedestrian change to DiceTcbInfo that puts the $crypto-key-type-choice value in there twice.\n\nNote: The $crypto-key-type-choice should probably not be a cert or cert-path form since the inclusion of the digest of the cert or path will affect the signature over the cert which is circular.\n\nThe internal representation doesn't mandate the existence of `element-list` (aka measurement-map) hence DiceTcbInfo.type could exists in an internal representation that populated only the environment. Hence, the duplicated value in measurement-values-map could be deleted for internal representation.\n\nNevertheless, the matching rules for evidence given instance-id.$crypto-key-type-choice with reference value having both instance-id.$crypto-key-type-choice and element-list.element-claims.$crypto-key-type-choice (where both values are the same) should still not trigger a processing error. \n\nThis will result in the Verifier being able to disambiguate Attesters based on the DeviceID credential, but not introduce some irregularity that requires the Verifier to start using certificate fields as if they were intended as Evidence. ",
          "createdAt": "2025-02-03T17:20:30Z",
          "updatedAt": "2025-02-03T19:07:43Z"
        },
        {
          "author": "nedmsmith",
          "authorAssociation": "CONTRIBUTOR",
          "body": "More context:\nThere are 3 ways to add novel environments to an ACS using corim schemas. \n(a) Evidence - Verifiers accepts it without logical conditions.\n(b) Conditional Endorsement - Verifier accepts it if the condition matches.\n(c) Membership triple - Verifier accepts it if the Endorser (signer) is in the TA list.\n\nRATS has made hand wavy observations that certificates are a form of endorsement. Any information in a certificate could in theory be considered to be Endorsement claims. But there isn't a discipline for how to map X.509 v3 fields into an ACS.\n\nIn (a), a device ID cert could contain attestatation information (e.g., DiceTcbInfo). But since the signer is the mfg'r, not an Attesting Env, the claims are actually Endorsements. Typically, Device ID certs are embedded in the Attester and hence are often size optimized. Adding an `instance-id` in this way may be mixed for practical reasons.\n\nIn (b), there's no real way to add an instance-id using conditions that are based on class attributes since ever member of the class would end up with the same instance identifier. Unless, there are special rules Verifiers follow.\n\nIn (c), the Verifier searches the certificate/path as the matching criteria. The domain-type could be extended to include $crypto-key-type-choice which includes matching on subject public key / key thumbprint. Note: matching on UUID as device instance id is already supported. This can then result in the addition of an ACS entry for an environment-map.instance-id. If the instance ID is in the cert used to authenticate to the Verifier, then the link between Attester-Verifier session and the ACS can be pinned down. Subsequently, any conditional endorsement that is specific to an instance of the Attester can be expressed in terms of the Attester's instance-id without needing special processing rules expressed as prose in a spec or profile.",
          "createdAt": "2025-02-03T22:35:01Z",
          "updatedAt": "2025-02-03T22:35:01Z"
        },
        {
          "author": "yogeshbdeshpande",
          "authorAssociation": "COLLABORATOR",
          "body": "@nedmsmith I agree with mostly what is said here. In addition to what is stated above, in PSA and Arm CCA Case, there is a instance identifier for each PSA/Arm CCA Device which is a `tagged-ue-id-type`  which binds the unique device instance to the Attestation Public key used to verify the Evidence. \n\nAnd yes,  Class Identifier should not be used to represent Device Instances, as all the Instance of the same class, share the same class identity.",
          "createdAt": "2025-02-04T18:03:28Z",
          "updatedAt": "2025-02-04T18:03:28Z"
        },
        {
          "author": "yogeshbdeshpande",
          "authorAssociation": "COLLABORATOR",
          "body": "And I think, the specification are adequately clear about usage of instances within the environment..\n\n`Instance measurements apply to a specific Attester instance. Environments identified by a class identifier have measurements that are common to the class. Environments identified by an instance identifier have measurements that are specific to that instance`",
          "createdAt": "2025-02-04T18:11:19Z",
          "updatedAt": "2025-02-04T18:11:19Z"
        },
        {
          "author": "nedmsmith",
          "authorAssociation": "CONTRIBUTOR",
          "body": "> tagged-ue-id-type\n\nHow does the tagged-ue-id-type get associated with the device class? Is it in the devID cert or is there an instance RIM that asserts it?",
          "createdAt": "2025-02-04T21:35:09Z",
          "updatedAt": "2025-02-04T21:35:09Z"
        }
      ]
    }
  ],
  "pulls": [
    {
      "number": 3,
      "id": "PR_kwDOMOnZXM6I9qc6",
      "title": "Ned additions jan 24",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/pull/3",
      "state": "MERGED",
      "author": "nedmsmith",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [
        "nedmsmith"
      ],
      "labels": [],
      "body": "Fleshed out sections for DICE TcbInfo evidence transformation and concise evidence transformation for the evidence-triples.",
      "createdAt": "2025-01-25T00:44:01Z",
      "updatedAt": "2025-01-25T18:21:29Z",
      "baseRepository": "ietf-rats-wg/draft-smith-rats-evidence-trans",
      "baseRefName": "main",
      "baseRefOid": "704056e0137c9a8488d35229cfafca94595b0bd0",
      "headRepository": "ietf-rats-wg/draft-smith-rats-evidence-trans",
      "headRefName": "ned-additions-jan-24",
      "headRefOid": "93ce1db60c1a0b03fcb2540defd31cb65a15c985",
      "closedAt": "2025-01-25T00:44:58Z",
      "mergedAt": "2025-01-25T00:44:58Z",
      "mergedBy": "nedmsmith",
      "mergeCommit": {
        "oid": "a878e56a41a221651b4016f74e073cc8d4d561f4"
      },
      "comments": [],
      "reviews": [
        {
          "id": "PRR_kwDOMOnZXM6Za9b9",
          "commit": {
            "abbreviatedOid": "93ce1db"
          },
          "author": "yogeshbdeshpande",
          "authorAssociation": "COLLABORATOR",
          "state": "COMMENTED",
          "body": "",
          "createdAt": "2025-01-25T09:42:39Z",
          "updatedAt": "2025-01-25T09:42:39Z",
          "comments": [
            {
              "originalPosition": 58,
              "body": "@nedmsmith it is reconciliation not Reconsiliation",
              "createdAt": "2025-01-25T09:42:39Z",
              "updatedAt": "2025-01-25T09:42:40Z"
            }
          ]
        },
        {
          "id": "PRR_kwDOMOnZXM6Za9dE",
          "commit": {
            "abbreviatedOid": "93ce1db"
          },
          "author": "yogeshbdeshpande",
          "authorAssociation": "COLLABORATOR",
          "state": "COMMENTED",
          "body": "See minor edits",
          "createdAt": "2025-01-25T09:43:11Z",
          "updatedAt": "2025-01-25T09:43:11Z",
          "comments": []
        },
        {
          "id": "PRR_kwDOMOnZXM6ZbR55",
          "commit": {
            "abbreviatedOid": "93ce1db"
          },
          "author": "nedmsmith",
          "authorAssociation": "CONTRIBUTOR",
          "state": "COMMENTED",
          "body": "",
          "createdAt": "2025-01-25T18:21:29Z",
          "updatedAt": "2025-01-25T18:21:29Z",
          "comments": [
            {
              "originalPosition": 58,
              "body": "I couldn't find the s spelling in any dictionary. Is it a British spelling? Whatever the spelling it should match what is in the CoRIM draft ",
              "createdAt": "2025-01-25T18:21:29Z",
              "updatedAt": "2025-01-25T18:21:29Z"
            }
          ]
        }
      ]
    },
    {
      "number": 4,
      "id": "PR_kwDOMOnZXM6JrmuV",
      "title": "Update draft-smith-rats-evidence-trans.md",
      "url": "https://github.com/ietf-rats-wg/draft-smith-rats-evidence-trans/pull/4",
      "state": "OPEN",
      "author": "nedmsmith",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [
        "nedmsmith"
      ],
      "labels": [],
      "body": "added content for sections on identity and attest key transformations. Updated acknowledgements section.",
      "createdAt": "2025-01-31T19:42:09Z",
      "updatedAt": "2025-01-31T19:43:28Z",
      "baseRepository": "ietf-rats-wg/draft-smith-rats-evidence-trans",
      "baseRefName": "main",
      "baseRefOid": "6d1b9df291af2d0eca4691912522d387a124c39f",
      "headRepository": "ietf-rats-wg/draft-smith-rats-evidence-trans",
      "headRefName": "key-trans",
      "headRefOid": "4e690b3535facc88909cb07d97f2ef3a5c4bc94c",
      "closedAt": null,
      "mergedAt": null,
      "mergedBy": null,
      "mergeCommit": null,
      "comments": [],
      "reviews": []
    }
  ]
}